# PlumbingFixturesVentConnection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PlumbingFixturesVentConnection Property
ParameterTypeId Class See Also
---
"Vent Connection"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PlumbingFixturesVentConnection { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PlumbingFixturesVentConnection As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PlumbingFixturesVentConnection {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace